{"keras_version": "2.2.4", "backend": "theano", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "dtype": "float32", "strides": [1, 1], "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [2, 2], "bias_regularizer": null, "activity_regularizer": null, "filters": 32, "padding": "valid", "kernel_regularizer": null, "name": "conv2d_1", "bias_constraint": null, "kernel_constraint": null, "batch_input_shape": [null, 32, 32, 1]}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "center": true, "name": "batch_normalization_1", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [2, 2], "activity_regularizer": null, "filters": 64, "padding": "valid", "kernel_regularizer": null, "name": "conv2d_2", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "center": true, "name": "batch_normalization_2", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "use_bias": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_constraint": null, "axis": -1, "center": true, "name": "batch_normalization_3", "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.8, "noise_shape": null, "seed": null, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"units": 46, "bias_regularizer": null, "use_bias": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "softmax"}}]}}